var prompt = require('prompt'); // Імпорт бібліотеки prompt для роботи з командним рядком

// Конфігурація schema для prompt (Взято з https://www.npmjs.com/package/prompt)
// regex: /^[0-9]\d*$/
// правило: Тільки цілі числа більші або дорівнюють 0
var schema = {
    properties: {
      age: {
        description: 'Скільки вам років?', // Опис для введення віку
        pattern: /^[0-9]\d*$/, // Regex паттерн для перевірки, що введене значення є додатнiм цілим числом
        message: 'Вік має бути додатним цілим числом', // Повідомлення при некоректному введенні
        required: true // Поле обов'язкове для заповнення
      }
    }
};

prompt.start(); // Запускаємо prompt для введення даних

// Отримуємо дані від користувача: вік
prompt.get(schema, function (err, result) {
    if (err) { // Перевіряємо, чи сталася помилка
      console.error(err); // Виводимо помилку в консоль
      return; // Завершуємо функцію у випадку помилки
    }

    var year = String()

    // Якщо останні дві цифри числа в діапазоні від 11 до 14 включно, використовуємо "років"
    if (result.age % 100 >= 11 && result.age % 100 <= 14) {
        year = result.age + " років";
    }
    else if (result.age % 10 === 1) {
        year = result.age + " рік"; // Якщо остання цифра 1, використовуємо "рік"
    }
    else if (result.age % 10 === 2 || result.age % 10 === 3 || result.age % 10 === 4) {
        year = result.age + " роки"; // Якщо остання цифра 2, 3 або 4, використовуємо "роки"
    }
    else {
        year = result.age + " років"; // Для всіх інших випадків використовуємо "років"
    }

    // або
    /*
    switch (year % 10) {
        case 1:
            return year + " рік"; // Якщо остання цифра 1, використовуємо "рік"
        case 2, 3, 4:
            return year + " роки"; // Якщо остання цифра 2, 3 або 4, використовуємо "роки"
        default:
            return year + " років"; // Для всіх інших випадків використовуємо "років"
    }
    */
    // Виводимо отримані дані
    console.log('  Вам: ' + year); // Виводимо вік з правильним закінченням
});
