var prompt = require('prompt'); // Імпорт бібліотеки prompt для роботи з командним рядком

prompt.start(); // Запускаємо prompt для введення даних

// Отримуємо дані від користувача: вік
prompt.get(['age'], function (err, result) {
    if (err) { // Перевіряємо, чи сталася помилка
      console.error(err); // Виводимо помилку в консоль
      return; // Завершуємо функцію у випадку помилки
    }

    if ((!isNaN(result.age)) && result.age >= 0) { // Перевіряємо, чи вік є додатнiм числом
        var year = String() // Ініціалізуємо змінну 'year' як пустий рядок що б не дублювати  console.log(...)

        // Якщо останні дві цифри числа в діапазоні від 11 до 14 включно, використовуємо "років"
        if (result.age % 100 >= 11 && result.age % 100 <= 14) {
            year = result.age + " років";
        }
        else if (result.age % 10 === 1) {
            year = result.age + " рік"; // Якщо остання цифра 1, використовуємо "рік"
        }
        else if (result.age % 10 === 2 || result.age % 10 === 3 || result.age % 10 === 4) {
            year = result.age + " роки"; // Якщо остання цифра 2, 3 або 4, використовуємо "роки"
        }
        else {
            year = result.age + " років"; // Для всіх інших випадків використовуємо "років"
        }

        // або
        /*
        switch (year % 10) {
            case 1:
                return year + " рік"; // Якщо остання цифра 1, використовуємо "рік"
            case 2, 3, 4:
                return year + " роки"; // Якщо остання цифра 2, 3 або 4, використовуємо "роки"
            default:
                return year + " років"; // Для всіх інших випадків використовуємо "років"
        }
        */
        // Виводимо отримані дані
        console.log('  Вам: ' + year); // Виводимо вік з правильним закінченням
    } else {
        console.log("Вік має бути додатним цілим числом")
    }
});
