function sumNonMultiplesOfThree() {
    let sum = 0;
    
    // Цикл проходить від 1 до 100 включно
    for (let i = 1; i <= 100; i++) {
        // Якщо число не кратне 3
        if (i % 3 !== 0) {
            // Додаємо його до суми
            sum += i;
        }
    }
    
    // Виводимо результат в консоль
    console.log("Сума чисел від 1 до 100, які не кратні 3: " + sum);
}

// Виклик функції
sumNonMultiplesOfThree();

//Або

// let sum = 0;
    
// // Цикл проходить від 1 до 100 включно
// for (let i = 1; i <= 100; i++) {
//     // Якщо число не кратне 3
//     if (i % 3 !== 0) {
//         // Додаємо його до суми
//         sum += i;
//     }
// }
    
// Виводимо результат в консоль
//console.log("Сума чисел від 1 до 100, які не кратні 3: " + sum);